{
  "template": {
    "doi": "",
    "title": "",
    "authors": "",
    "year": "",
    "month": "",
    "day": "",
    "journal": "",
    "volume": "",
    "page": "",
    "abs": "",
    "graph_abs": ""
  },
  "publications": {
    "xufanding2024mespool": {
      "doi": "10.1093/bib/bbad423",
      "title": "MESPool: Molecular Edge Shrinkage Pooling for hierarchical molecular representation learning and property prediction",
      "authors": "Fanding Xu, Zhiwei Yang, Lizhuo Wang, Deyu Meng, Jiangang Long",
      "year": "2024",
      "month": "1",
      "day": "1",
      "journal": "Briefings in Bioinformatics",
      "volume": "25",
      "page": "bbad423",
      "graph_abs": "imgs/publications/mespool.png",
      "abs": "Identifying task-relevant structures is important for molecular property prediction. In a graph neural network (GNN), graph pooling can group nodes and hierarchically represent the molecular graph. However, previous pooling methods either drop out node information or lose the connection of the original graph; therefore, it is difficult to identify continuous subtructures. Importantly, they lacked interpretability on molecular graphs. To this end, we proposed a novel Molecular Edge Shrinkage Pooling (MESPool) method, which is based on edges (or chemical bonds). MESPool preserves crucial edges and shrinks others inside the functional groups and is able to search for key structures without breaking the original connection. We compared MESPool with various well-known pooling methods on different benchmarks and showed that MESPool outperforms the previous methods. Furthermore, we explained the rationality of MESPool on some datasets, including a COVID-19 drug dataset."
    },
    "xufanding2025molunet": {
      "doi": "10.1016/j.actphy.2025.100209",
      "title": "MolUNet++: Adaptive-grained explicit substructure and interaction aware molecular representation learning",
      "authors": "Fanding Xu, Zhiwei Yang, Sirui Wu, Wu Su, Lizhuo Wang, Deyu Meng, Jiangang Long",
      "year": "2025",
      "month": "11",
      "day": "4",
      "journal": "Acta Physico-Chimica Sinica",
      "volume": "",
      "page": "100209",
      "graph_abs": "imgs/publications/molunet.png",
      "abs": "Molecular representation learning is a critical task in AI-driven drug development. While graph neural networks (GNNs) have demonstrated strong performance and gained widespread adoption in this field, efficiently extracting and explicitly analyzing functional groups remains a challenge. To address this issue, we propose MolUNet++, a novel model that employs Molecular Edge Shrinkage Pooling (MESPool) for hierarchical substructure extraction, utilizes a Nested UNet framework for multi-granularity feature integration, and incorporates a substructure masking explainer for quantitative fragment analysis. We evaluated MolUNet++ on tasks including molecular property prediction, drug-drug interaction (DDI) prediction, and drug-target interaction (DTI) prediction. Experimental results demonstrate that MolUNet++ not only outperforms traditional GNN models in predictive performance but also exhibits explicit, intuitive, and chemically logical interpretability. This capability provides valuable insights and tools for researchers in drug design and optimization."
    },
    "xufanding2023comparative": {
      "doi": "10.1016/j.dsp.2023.103937",
      "title": "Comparative study of non-convex penalties and related algorithms in compressed sensing",
      "authors": "Fanding Xu, Junbo Duan, Wenyu Liu",
      "year": "2023",
      "month": "4",
      "day": "30",
      "journal": "Digital Signal Processing",
      "volume": "135",
      "page": "103937",
      "graph_abs": "imgs/publications/xufanding2023comparative.jpg",
      "abs": "Non-convex penalties are widely used in sparse representation models and fields such as compressed sensing, because they can efficiently recover signals with a high sparsity level compared with the well-known l1-norm. However, few classic penalties have been selected in most applications without exploring the performance of other non-convex penalties. Therefore, the objective of this study is to provide a comparative and comprehensive study on non-convex penalties. We first collected nine representative non-convex penalties and then applied two optimization frameworks: the difference of convex function algorithm (DCA) and iterative shrinkage/thresholding algorithm (ISTA) to solve the optimization problems associated with the nine non-convex penalties. The performances of the nine penalties and two algorithms were systematically compared and analyzed experimentally. We hope that these results that concern non-convex penalty selection in sparse representation models can be used as a general reference for research."
    },
    "zhengxinzhe2025pring": {
      "doi": "10.48550/arXiv.2507.05101",
      "title": "Pring: Rethinking protein-protein interaction prediction from pairs to graphs",
      "authors": "Xinzhe Zheng, Hao Du, Fanding Xu, Jinzhe Li, Zhiyuan Liu, Wenkang Wang, Tao Chen, Wanli Ouyang, Stan Z Li, Yan Lu, Nanqing Dong, Yang Zhang",
      "year": "2025",
      "month": "7",
      "day": "7",
      "journal": "NeurIPS 2025",
      "volume": "Poster",
      "page": "",
      "graph_abs": "imgs/publications/pring.png",
      "abs": "Deep learning-based computational methods have achieved promising results in predicting protein-protein interactions (PPIs). However, existing benchmarks predominantly focus on isolated pairwise evaluations, overlooking a model's capability to reconstruct biologically meaningful PPI networks, which is crucial for biology research. To address this gap, we introduce PRING, the first comprehensive benchmark that evaluates protein-protein interaction prediction from a graph-level perspective. PRING curates a high-quality, multi-species PPI network dataset comprising 21,484 proteins and 186,818 interactions, with well-designed strategies to address both data redundancy and leakage. Building on this golden-standard dataset, we establish two complementary evaluation paradigms: (1) topology-oriented tasks, which assess intra and cross-species PPI network construction, and (2) function-oriented tasks, including protein complex pathway prediction, GO module analysis, and essential protein justification. These evaluations not only reflect the model's capability to understand the network topology but also facilitate protein function annotation, biological module detection, and even disease mechanism analysis. Extensive experiments on four representative model categories, consisting of sequence similarity-based, naive sequence-based, protein language model-based, and structure-based approaches, demonstrate that current PPI models have potential limitations in recovering both structural and functional properties of PPI networks, highlighting the gap in supporting real-world biological applications. We believe PRING provides a reliable platform to guide the development of more effective PPI prediction models for the community. "
    },
    "wanglizhuo2025discovery": {
      "doi": "10.1016/j.jpha.2026.101579",
      "title": "Discovery of Mitochondrial Modulators Using Target-Aggregated Machine Learning",
      "authors": "Lizhuo Wang, Peng Yang, Sirui Wu, Fanding Xu, Wu Su, Le Shi, Hui Guo, Li Cui, Jiankang Liu, Zhiwei Yang, Jiangang Long",
      "year": "2026",
      "month": "2",
      "day": "9",
      "journal": "Journal of Pharmaceutical Analysis",
      "volume": "",
      "page": "",
      "graph_abs": "imgs/publications/wanglizhuo2025discovery.jpg",
      "abs": "Mitochondria play a central role in cellular metabolism, and their dysfunction is implicated in a range of neurodegenerative, metabolic, and cardiovascular diseases. Current artificial intelligence (AI) approaches in mitochondrial drug discovery are often restricted to narrow mechanistic contexts, such as mitophagy, and are limited by sparse and heterogeneous bioactivity data. To address these challenges, we developed a generalized, target-agnostic machine learning strategy to identify diverse mitochondrial modulators. By integrating bioactivity data across address mitochondrial proteins and applying advanced preprocessing and modeling techniques, we constructed a highly predictive classification model. This model successfully identified novel modulators from a large chemical library, underscoring the potential of computational methods in phenotypic drug discovery for complex biological systems. Our target-aggregated machine learning framework supports broad drug activity profiling across mitochondrial mechanisms, improves screening efficiency, and enriches high-confidence hits from extensive libraries while preserving structural novelty. "
    },
    "suwu2024screening": {
      "doi": "10.1021/acsami.3c18102",
      "title": "Screening of CPT1A-Targeting Lipid Metabolism Modulators Using Mitochondrial Membrane Chromatography",
      "authors": "Wu Su, Fanding Xu, Jinjin Zhong, Ranrui Hu, Lizhuo Wang, Hua Li, Zhiwei Yang, Shuai Ge, Huaizhen He, Shengli Han, Xiuying Xie, Hui Guo, Langchong He, Jiankang Liu, Tao Yi, Yu Kong, Jiangang Long",
      "year": "2024",
      "month": "2",
      "day": "27",
      "journal": "ACS Applied Materials & Interfaces",
      "volume": "16",
      "page": "13234-13246",
      "graph_abs": "imgs/publications/suwu2024screening.webp",
      "abs": "Carnitine palmitoyltransferase 1A (CPT1A), which resides on the mitochondrial outer membrane, serves as the rate-limiting enzyme of fatty acid β-oxidation. Identifying the compounds targeting CPT1A warrants a promising candidate for modulating lipid metabolism. In this study, we developed a CPT1A-overexpressed mitochondrial membrane chromatography (MMC) to screen the compounds with affinity for CPT1A. Cells overexpressing CPT1A were cultured, and subsequently, their mitochondrial membrane was isolated and immobilized on amino-silica gel cross-linked by glutaraldehyde. After packing the mitochondrial membrane column, retention components of MMC were performed with LC/MS, whose analytic peaks provided structural information on compounds that might interact with mitochondrial membrane proteins. With the newly developed MMC–LC/MS approach, several Chinese traditional medicine extracts, such as Scutellariae Radix and Polygoni Cuspidati Rhizoma et Radix (PCRR), were analyzed. Five noteworthy compounds, baicalin, baicalein, wogonoside, wogonin, and resveratrol, were identified as enhancers of CPT1A enzyme activity, with resveratrol being a new agonist for CPT1A. The study suggests that MMC serves as a reliable screening system for efficiently identifying modulators targeting CPT1A from complex extracts."
    },
    "suwu2024twin": {
      "doi": "10.1021/acs.analchem.4c02402",
      "title": "Twin strep-tag modified CPT1A mitochondrial membrane chromatography in screening lipid metabolism regulators",
      "authors": "Wu Su, Peng Yang, Fanding Xu, Tingrong Zhang, Lizhuo Wang, Hua Li, Li Cui, Zhiwei Yang, Huaizhen He, Shengli Han, Langchong He, Jiankang Liu, Yu Kong, Jiangang Long",
      "year": "2024",
      "month": "6",
      "day": "24",
      "journal": "Analytical Chemistry",
      "volume": "96",
      "page": "10851-10859",
      "graph_abs": "imgs/publications/suwu2024twin.webp",
      "abs": "Mitochondrial Membrane Chromatography (MMC) is a bioaffinity chromatography technique developed to study the interaction between target proteins embedded in the mitochondrial membrane and their ligand compounds. However, the MMC stationary phases (MMSP) prepared by chemical immobilization are prone to nonspecific binding in candidate agent screening inevitably. To address these challenges, Twin Strep-Tag/Strep Tactin was employed to establish a specific affinity system in the present study. We prepared a carnitine palmitoyltransferase 1A (CPT1A) MMSP by specifically linking Strep-tactin-modified silica gel with the Twin Strep-Tag on the CPT1A-oriented mitochondrial membrane. This Twin Strep-Tag/Strep Tactin modified CPT1A/MMC method exhibited remarkably better retention behavior, longer stationary phase lifespan, and higher screening specificity compared with previous MMC systems with glutaraldehyde immobilization. We adopted the CPT1A-specific MMC system in screening CPT1A ligands from traditional Chinese medicines, and successfully identified novel candidate ligands: ononin, isoliquiritigenin, and aloe-emodin, from Glycyrrhiza uralensis Fisch and Senna tora (L.) Roxb extracts. Biological assessments illustrated that the compounds screened promote CPT1A enzyme activity without affecting CPT1A protein expression, as well as effectively reduce the lipid droplets and triglyceride levels in the high fat induction HepG2 cells. The results suggest that we have developed an MMC system, which is promising for studying the bioaffinity of mitochondrial membrane proteins to candidate compounds. This system provides a platform for a key step in mitochondrial medicine discovery, especially for bioactive molecule screening from complex herbal extracts."
    },
    "yeqiushi2024comutations": {
      "doi": "10.3390/ijms25094662",
      "title": "Co-Mutations and Possible Variation Tendency of the Spike RBD and Membrane Protein in SARS-CoV-2 by Machine Learning",
      "authors": "Qiushi Ye, He Wang, Fanding Xu, Sijia Zhang, Shengli Zhang, Zhiwei Yang, Lei Zhang",
      "year": "2024",
      "month": "4",
      "day": "25",
      "journal": "International Journal of Molecular Sciences",
      "volume": "25",
      "page": "4662",
      "graph_abs": "imgs/publications/yeqiushi2024comutations.png",
      "abs": "Since the onset of the coronavirus disease 2019 (COVID-19) pandemic, SARS-CoV-2 variants capable of breakthrough infections have attracted global attention. These variants have significant mutations in the receptor-binding domain (RBD) of the spike protein and the membrane (M) protein, which may imply an enhanced ability to evade immune responses. In this study, an examination of co-mutations within the spike RBD and their potential correlation with mutations in the M protein was conducted. The EVmutation method was utilized to analyze the distribution of the mutations to elucidate the relationship between the mutations in the spike RBD and the alterations in the M protein. Additionally, the Sequence-to-Sequence Transformer Model (S2STM) was employed to establish mapping between the amino acid sequences of the spike RBD and M proteins, offering a novel and efficient approach for streamlined sequence analysis and the exploration of their interrelationship. Certain mutations in the spike RBD, G339D-S373P-S375F and Q493R-Q498R-Y505, are associated with a heightened propensity for inducing mutations at specific sites within the M protein, especially sites 3 and 19/63. These results shed light on the concept of mutational synergy between the spike RBD and M proteins, illuminating a potential mechanism that could be driving the evolution of SARS-CoV-2."
    },
    "yangpeng2025from": {
      "doi": "10.1016/j.freeradbiomed.2025.05.389",
      "title": "From aldehyde metabolism to delay aging: targeting ALDH as a novel strategy",
      "authors": "Peng Yang, Wu Su, Lizhuo Wang, Fanding Xu, Yu Kong, Jiangang Long",
      "year": "2025",
      "month": "5",
      "day": "9",
      "journal": "Free Radical Biology and Medicine",
      "volume": "236",
      "page": "70-86",
      "graph_abs": "imgs/publications/yangpeng2025from.jpg",
      "abs": "Aldehydes are molecules that are commonly found in both human physiology and the environment. The accumulation of these substances can lead to the cross-linking of intracellular DNA and proteins, thereby disrupting cellular function and contributing to the processes of premature aging and age-related diseases. Aldehyde dehydrogenase 2 (ALDH2), the key member of ALDH family, is an enzyme responsible for aldehyde metabolism, composed of four identical subunits located within the mitochondrial matrix. Its primary role is to catalyze the oxidation of aldehydes, resulting in the formation of their corresponding acid metabolites. This paper presents a succinct overview of the sources and metabolic pathways of key aldehydes within the human body, compares the various primary enzymes involved in aldehyde metabolism, and explores the structural and functional characteristics of ALDH2. Furthermore, ALDH2 is proposed as a potential therapeutic target for addressing aging and associated diseases. The discussion also includes prospective research avenues, particularly focusing on ALDH2 agonists and aldehyde scavengers designed to enhance the clearance of reactive aldehydes and safeguard cellular functions, thereby mitigating aldehyde-induced cellular damage and potentially delaying the aging process."
    },
    "liuwenyu2021smoothing": {
      "doi": "10.1109/ACCESS.2021.3132641",
      "title": "Smoothing of time-varying graph with the generalized LASSO",
      "authors": "Wenyu Liu, Hao Yan, Qing Wang, Nan Hu, Ni Liu, Fanding Xu, Junbo Duan",
      "year": "2021",
      "month": "12",
      "day": "3",
      "journal": "IEEE Access",
      "volume": "9",
      "page": "162348-162358",
      "graph_abs": "imgs/publications/liuwenyu2021smoothing.jpg",
      "abs": "This paper proposes a joint model based on the generalized LASSO to smooth a time-varying graph. The model generalizes the gLASSO from a purely spatial setting to a spatial-temporal one. In the proposed model, the first term measures the fitting error, while the second term incorporates the structural information of graphs and total variations of time sequence, and hence the model can extract both temporal and spatial information. To illustrate the performance of the proposed model, we analyzed the simulated datasets for epidemic diseases and the real datasets for COVID-19 and mortality rate in mainland China. The results show that the proposed model can capture the trends/regions simultaneously in both temporal and spatial domains, being an effective model to analyze the problems that can be modelled as time-varying graphs."
    },
    "taolinjie2025ai": {
      "doi": "10.16476/j.pibb.2024.0530",
      "title": "基于人工智能的蛋白质热力学稳定性预测",
      "authors": "陶林节， 徐凡丁， 郭宇， 龙建纲， 鲁卓阳",
      "year": "2025",
      "month": "6",
      "day": "5",
      "journal": "生物化学与生物物理进展",
      "volume": "52",
      "page": "1972",
      "graph_abs": "",
      "abs": "人工智能技术在生物学领域的应用在近几年取得了突飞猛进的发展,其中最显著的成果为蛋白质结构预测和设计,该成果于2024年荣获诺贝尔化学奖.可以预见,对蛋白质各类物理和化学属性的精准预测将是蛋白质预测领域下一阶段的重要发展方向.蛋白质热力学稳定性在深入了解生命活动机制,药物研发,疾病诊断和治疗,以及生物技术产业中酶制剂的生产,生物传感器研发以及蛋白质药物制备等方面均具有重要意义.借助人工智能技术进行蛋白质热力学稳定性的精准预测将大幅提升蛋白质相关的科学研究能力和产业发展效率.本文综述了蛋白质热力学稳定性预测技术的发展历程,梳理了从生物实验测定方法,传统能量函数计算方法到现代机器学习预测方法.重点讨论了基于机器学习的预测模型,尤其是深度神经网络,图神经网络和注意力机制等前沿算法在蛋白质热力学稳定性预测中的突破.深入讨论了突变稳定性预测的核心挑战,如数据集质量与数量不平衡,模型过拟合及蛋白质动态性的建模等难题.旨在为研究人员提供一个全面的参考框架,助力突变蛋白质热力学稳定性预测技术的发展."
    },
    "liuni2021hmm": {
      "doi": "10.3969/j.issn.0258-8021.2021.03.14",
      "title": "基于隐马尔可夫模型的全外显子测序拷贝数变异检测算法研究",
      "authors": "刘妮， 刘晗， 赵阿曼， 徐凡丁， 刘文宇， 段君博",
      "year": "2021",
      "month": "",
      "day": "",
      "journal": "中国生物医学工程学报",
      "volume": "40",
      "page": "380-384",
      "graph_abs": "",
      "abs": "拷贝数变异(CNV)是基因组变异的一种非平衡结构变异,与癌症等许多复杂疾病相关.目前,基于隐马尔可夫模型(HMM)的CNV检测算法已经成为基因检测研究中的一大热点,但是对于这些基于HMM的CNV检测工具并没有进行过系统的比较,导致在应用时选择困难.选取5种具有代表性的基于HMM的CNV检测工具:ExomeDepth、ExomeCopy、XHMM、ADTex和CANOES,分别使用仿真和真实的全外显子组测序数据进行检测,选择真阳性率(TPR)、假发现率(FDR)、运行时间等作为评价指标,对不同覆盖深度、CNV密度等情况下算法的性能进行评估.结果 表明:随着覆盖深度的增加,5种工具的TPR上升、FDR下降;CNV密度的变化也会影响CNV检测工具的TPR.此外,ExomeDepth对于真实数据的检测精度明显高于其他算法,是无特殊需求时的首选算法.在相同条件下,ExomeCopy运行速度最快,XHMM速度最慢.根据实验结果,对不同应用场景推荐合适的CNV检测算法,可帮助研究人员根据自身项目情况选择合适的CNV检测工具,也有助于在临床上的应用."
    },
    "duyiming2020experimental": {
      "doi": "10.16156/j.1004-7220.2020.05.012",
      "title": "Experimental study on axial dynamic impact of rabbit single vertebra",
      "authors": "杜一铭， 张绪树， 郭媛， 徐凡丁， 盛文倩",
      "year": "2020",
      "month": "10",
      "day": "23",
      "journal": "医用生物力学",
      "volume": "35",
      "page": "463-469",
      "graph_abs": "",
      "abs": "目的通过对兔单椎进行动态冲击破坏试验,并与静态压缩实验进行对比,研究椎体轴向冲击的损伤机制。方法通过落锤动态冲击实验装置,利用示波器和高速摄影获得力传感器的电压波形图和椎体冲击的详细过程。结果胸、腰椎平均静态载荷分别为910、947 N,平均动态载荷分别为1 196、1 026 N;胸、腰椎平均动荷系数分别为1.37和1.08。静载条件下,胸、腰椎平均等效应力为15.28、12.51 MPa;动载条件下,胸、腰椎平均等效应力20.03、13.56 MPa。动态冲击过程中,纵向、横向平均应变分别为-0.3和-0.005(压缩);动载条件下,椎骨的破坏能量从0 J一直增大到4.4 J。结论在动、静态实验条件下,同一椎体动态载荷大于静态载荷;胸椎平均动荷系数大于腰椎;胸椎应力大于腰椎;椎体受到轴向冲击力时纵向应变大于横向应变;椎体能量增长呈现先缓慢后快速的过程。研究结果可以为临床人脊柱椎体损伤的预防和康复提供指导意见。"
    }
  }
}
